[
 {
  "date": "2026-01-05T10:00:00Z",
  "content": "🔎 Step‑Wise Procedure to Verify an Indian Company:\n\n1️⃣ Refer to Verified Profile on LinkedIn 💼\nCheck if the company has an official LinkedIn page, preferably with a verification badge, and ensure details match its website and other registrations.\n\n2️⃣ Verify Owner’s Aadhaar Card 🆔\nUse the UIDAI official portal to confirm authenticity:\nhttps://myaadhaar.uidai.gov.in/verifyAadhaar\n\n3️⃣ Verify GST Number 💰\nConfirm GSTIN details on the GST portal:\nhttps://services.gst.gov.in/services/searchtp\n\n4️⃣ Search on Google & B2B Portals 🌐\nEnsure the company appears on Google Maps 📍 with a physical location and is listed on B2B portals like IndiaMART, TradeIndia, or JustDial.\n\n5️⃣ Check IEC Code 📦\nFor import/export companies, verify IEC details on the DGFT portal:\nhttps://www.dgft.gov.in/IEC_Online/\n\n6️⃣ Search Internet for Adverse News 📰\nLook for fraud or dispute reports. ⚠️ Do not get influenced instantly; allow the company to clarify, as competitors may spread misinformation. This step is crucial.\n\n7️⃣ Verify Mobile/Phone Number 📞\nCall the listed number. A direct conversation often reveals professionalism, responsiveness, and authenticity.\n\n✨ Key Takeaway:\nBy combining digital checks (LinkedIn, Aadhaar, GST, IEC) with practical verification (Google Maps, B2B listings, phone calls), you can systematically confirm the authenticity of any Indian company.",
  "language": "English",
  "mood": "instructional"
}

,  
  
  {
    "date": "2025-12-12T10:00:00Z",
    "content": "Zinc Ingot(Kaskut) prices are stable today despite minor fluctuations in LME. Demand remains steady in the automotive die-casting sector. ADC12 is showing a slight upward trend due to holiday season logistics pressure.\n\nKey Takeaway: Buy now to lock in prices before next week's anticipated jump.",
    "language": "English",
    "mood": "forecast"
  },
  {
    "date": "2025-12-10T15:30:00Z",
    "content": "Important update for all buyers: The government has announced new regulations regarding secondary metal scrap import. This may affect our raw material costs starting next month. We advise clients to place larger orders this week to utilize current stock pricing.\n\nWarning: Expect short-term price volatility.",
    "language": "English",
    "mood": "forecast"
  },
  {
    "date": "2025-12-08T09:00:00Z",
    "content": "सभी खरीदारों के लिए आज का बाजार अपडेट: एल्युमीनियम ADC12 सिल्लियों की आपूर्ति श्रृंखला अब सामान्य है। त्यौहारी मांग के कारण कीमतें उच्च बनी हुई हैं, लेकिन हम नए ऑर्डर के लिए 7 दिन की डिलीवरी का समय दे रहे हैं।",
    "language": "Hindi",
    "mood": "festive"
  }
]
